/**
 * https://www.w3schools.com/js/js_classes.asp
 * OOП - обєктно орієнтоване програмвання
 * три принципи
 * 1) інкапсуляція - принцип чорної скриньки приватні  публічні змінні
 * 2) наслідування - один клас може наслідувати все від іншого (батьківськи (parent) дитячий (child))
 * .....не існує в js ......
 * 3) поліморфізм - один інтерфейс багато реалізацій
 *
 *
 *  Створити клас телефон із 5 властивостями і двома методами
 *  Створити клас android iPhone які наслідуються із класу телефон із 2 додатковими методами
 *  Створити 1 статичний мтод
 *  Створити гетер сетер 
 * */
